parameterStudy/template_square/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       21240;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       21270;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          540;
        startFace       21300;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       21840;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          21600;
        startFace       21960;
    }
)

// ************************************************************************* //
